#+TITLE: 玩转词云
#+DATE: <2017-08-22 Tue>
#+LAYOUT: post
#+OPTIONS: ':t author:nil ^:{}
#+TAGS: python, jieba, wordcloud
#+CATEGORIES: 技术积累
#+STARTUP: content

** 分词
   :PROPERTIES:
   :ID:       a7a6f9a3-eee0-4e7a-8ec2-a3281cbdb2ba
   :END:
  #+NAME: jieba-cut
  #+BEGIN_SRC python :preamble "# -*- coding: utf-8 -*-" :results output :var srcWd="做最好的Python中文分词组件"
    import jieba

    seg_list = jieba.cut(srcWd, cut_all=True)
    print(u'Full mode:' + u'/ '.join(seg_list))

    seg_list = jieba.cut(srcWd, cut_all=False)
    print(u'Default mode:' + u'/ '.join(seg_list))

    seg_list = jieba.cut_for_search(srcWd)
    print(u', '.join(seg_list))
  #+END_SRC

  #+RESULTS:
  : Full mode:做/ 最好/ 的/ Python/ 中文/ 分词/ 词组/ 组件
  : Default mode:做/ 最好/ 的/ Python/ 中文/ 分词/ 组件
  : 做, 最好, 的, Python, 中文, 分词, 组件

  #+call: jieba-cut(srcWd="我目前在学习Golang和Python。")

  #+RESULTS:
  : Full mode:我/ 目前/ 在/ 学习/ Golang/ 和/ Python/
  : Default mode:我/ 目前/ 在/ 学习/ Golang/ 和/ Python/ 。
  : 我, 目前, 在, 学习, Golang, 和, Python, 。
** 调整词典
   :PROPERTIES:
   :ID:       0f9f838d-0b96-4d20-bbd0-f9b31664e187
   :END:

   #+NAME: jieba-freq
   #+BEGIN_SRC python :preamble "# -*- coding: utf-8 -*-" :results output :var srcWd="做最好的Python中文分词组件"
     import jieba
     import jieba.analyse

     print(', '.join(
         jieba.analyse.extract_tags(srcWd, allowPOS=('n', 'nz', 'eng', 'vn'))))
     jieba.load_userdict('../resource/userdict.txt')
     print(', '.join(
         jieba.analyse.extract_tags(srcWd, allowPOS=('n', 'nz', 'eng', 'vn'))))
   #+END_SRC

   #+RESULTS: jieba-freq
   : Python, 分词, 组件, 中文
   : Python, 分词, 组件, 中文

   #+call: jieba-freq(srcWd="1. 扎实的计算机学科基础 2. 数据仓库和数据建模工作经验三年以上，良好的业务理解能力和模型抽象能力 3. 有海量大数据平台使用经验，熟悉hadoop、odps、hive等平台的使用 4. 有数据挖掘经验的优先考虑 5. 具有良好的沟通和团队协作能力，对业务有良好的理解能力和敏锐度")

   #+RESULTS:
   : 理解能力, 经验, 数据挖掘, 敏锐度, 平台, odps, hadoop, 数据仓库, hive, 建模, 业务, 海量, 能力, 数据, 协作, 优先, 团队, 模型, 计算机, 学科
   : 理解能力, 经验, 数据挖掘, 敏锐度, 平台, odps, hadoop, 数据仓库, hive, 建模, 业务, 海量, 能力, 数据, 协作, 优先, 团队, 模型, 计算机, 学科

** 关键词提取
   :PROPERTIES:
   :ID:       7308abe6-a074-4153-a4c0-bb74f199bb07
   :END:
   #+NAME: jieba-analyse
   #+BEGIN_SRC python :preamble "# -*- coding: utf-8 -*-" :results output :var srcWd="做最好的Python中文分词组件"
     import jieba.analyse

     print(', '.join(jieba.analyse.extract_tags(srcWd, allowPOS=())))
     print(', '.join(
         jieba.analyse.extract_tags(srcWd, allowPOS=('n', 'nt', 'nz', 'eng', 'vn'
                                                     ))))
     wordlst = jieba.analyse.extract_tags(
         srcWd, withWeight=True, allowPOS=('n', 'nt', 'nz', 'eng', 'vn'))

     for word in wordlst:
         print(word[0] + ": " + str(word[1]))
   #+END_SRC

   #+RESULTS: jieba-analyse
   : Python, 分词, 组件, 中文, 最好
   : Python, 分词, 组件, 中文
   : Python: 2.98869187572
   : 分词: 2.92586326865
   : 组件: 2.34472226873
   : 中文: 2.03702625329

   #+call: jieba-analyse(srcWd="1. 扎实的计算机学科基础 2. 数据仓库和数据建模工作经验三年以上，良好的业务理解能力和模型抽象能力 3. 有海量大数据平台使用经验，熟悉hadoop、odps、hive等平台的使用 4. 有数据挖掘经验的优先考虑 5. 具有良好的沟通和团队协作能力，对业务有良好的理解能力和敏锐度")

   #+NAME: jieba-analyse-tr
   #+BEGIN_SRC python :preamble "# -*- coding: utf-8 -*-" :results output :var srcWd="做最好的Python中文分词组件"
     import jieba.analyse

     print(', '.join(jieba.analyse.textrank(srcWd)))
     print(', '.join(
         jieba.analyse.textrank(srcWd, allowPOS=('n', 'nz', 'eng', 'vn'))))
   #+END_SRC

   #+RESULTS: jieba-analyse-tr
   : 组件, 分词
   : 组件, 分词, 中文, Python

   #+call: jieba-analyse-tr(srcWd="1. 扎实的计算机学科基础 2. 数据仓库和数据建模工作经验三年以上，良好的业务理解能力和模型抽象能力 3. 有海量大数据平台使用经验，熟悉hadoop、odps、hive等平台的使用 4. 有数据挖掘经验的优先考虑 5. 具有良好的沟通和团队协作能力，对业务有良好的理解能力和敏锐度")

** 词性标注
   :PROPERTIES:
   :ID:       ba65f4b7-159b-440a-9df3-ac90465716e4
   :END:
   #+NAME: jieba-posseg
   #+BEGIN_SRC python :preamble "# -*- coding: utf-8 -*-" :results output :var srcWd="做最好的Python中文分词组件"
     import jieba
     import jieba.posseg as pseg

     jieba.load_userdict('../resource/userdict.txt')
     words = pseg.cut(srcWd)
     for word, flag in words:
         print('%s %s' % (word, flag))
   #+END_SRC

   #+RESULTS: jieba-posseg
   : 做 v
   : 最好 a
   : 的 uj
   : Python nz
   : 中文 nz
   : 分词 n
   : 组件 n

   #+call: jieba-posseg(srcWd="1. 扎实的计算机学科基础 2. 数据仓库和数据建模工作经验三年以上，良好的业务理解能力和模型抽象能力 3. 有海量大数据平台使用经验，熟悉hadoop、odps、hive等平台的使用 4. 有数据挖掘经验的优先考虑 5. 具有良好的沟通和团队协作能力，对业务有良好的理解能力和敏锐度")

